#include <iostream>
using namespace std;
void main()
{
	setlocale(LC_ALL, "Russian");
	int h1, m1, s1, h2, m2, s2, a, b;
	cout << "введите начало промежутка времени в часах, минутах и секундах" << endl;
	cin >> h1 >> m1 >> s1;
	cout<< "введите конец промежутка времени в часах, минутах и секундах (в пределах одних суток)" << endl;
	cin >> h2 >> m2 >> s2;
	a = (h1 * 3600 + m1 * 60 + s1);
	b =	(h2 * 3600 + m2 * 60 + s2);
	cout << "Промежуток равен "<<(b - a) / 3600 << ":" << ((b - a) - (((b - a) / 3600) * 3600)) / 60 << ":" << (b - a) - ((b - a) / 3600 * 3600) - (((b - a) - ((b - a) / 3600 * 3600)) / 60 * 60);
}